In [10]:
import pandas as pd

# Przykład:
df1 = pd.DataFrame({
    'name': ['Ala', 'Bartek', 'Celina'],
    'age': [25, 30, 35]
}, index=[1, 2, 3])

df2 = pd.DataFrame({
    'city': ['Kraków', 'Warszawa', 'Gdańsk']
}, index=[2, 3, 4])

pd.concat([df1.reset_index(), df2.reset_index()], axis=1)

   index    name  age  index      city
0      1     Ala   25      2    Kraków
1      2  Bartek   30      3  Warszawa
2      3  Celina   35      4    Gdańsk

In [12]:
df1.join(df2) # how='left'
df1.join(df2, how='outer')

     name   age      city
1     Ala  25.0       NaN
2  Bartek  30.0    Kraków
3  Celina  35.0  Warszawa
4     NaN   NaN    Gdańsk

In [17]:
df3 = pd.DataFrame({
    'name': ['Ala', 'Celina', 'Daniel'],
    'city': ['Lublin', 'Łódź', 'Poznań']
})

pd.concat([df1.reset_index(), df3.reset_index()], axis=1)

# df1.join(df3.set_index('name'), on='name')

   index    name  age  index    name    city
0      1     Ala   25      0     Ala  Lublin
1      2  Bartek   30      1  Celina    Łódź
2      3  Celina   35      2  Daniel  Poznań

In [18]:
df1.join(df3.set_index('name'), on='name')

     name  age    city
1     Ala   25  Lublin
2  Bartek   30     NaN
3  Celina   35    Łódź

In [23]:
import pandas as pd

# DF1: informacje o osobach
df1 = pd.DataFrame({
    'id': [1, 2, 3, 4],
    'name': ['Ala', 'Bartek', 'Celina', 'Daniel'],
    'age': [25, 30, 35, 40],
    'group': ['A', 'B', 'A', 'C']
})

# DF2: informacje uzupełniające (np. miasto, wynik)
df2 = pd.DataFrame({
    'id': [3, 4, 5, 6],
    'city': ['Kra', 'Waw', 'Gda', 'Wro'],
    'score': [25, 30, 35, 100],
    'group': ['A', 'C', 'B', 'A']
}, index=[1,2,3,4])

pd.concat([df1, df2], axis=1)

    id    name   age group   id city  score group
0  1.0     Ala  25.0     A  NaN  NaN    NaN   NaN
1  2.0  Bartek  30.0     B  3.0  Kra   25.0     A
2  3.0  Celina  35.0     A  4.0  Waw   30.0     C
3  4.0  Daniel  40.0     C  5.0  Gda   35.0     B
4  NaN     NaN   NaN   NaN  6.0  Wro  100.0     A

In [24]:
pd.merge(df1, df2, how='inner', right_index=True, left_index=True)

   id_x    name  age group_x  id_y city  score group_y
1     2  Bartek   30       B     3  Kra     25       A
2     3  Celina   35       A     4  Waw     30       C
3     4  Daniel   40       C     5  Gda     35       B

In [26]:
pd.merge(df1, df2, how='left', right_index=True, left_index=True)

   id_x    name  age group_x  id_y city  score group_y
0     1     Ala   25       A   NaN  NaN    NaN     NaN
1     2  Bartek   30       B   3.0  Kra   25.0       A
2     3  Celina   35       A   4.0  Waw   30.0       C
3     4  Daniel   40       C   5.0  Gda   35.0       B